; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	spectrograph5 - mode
	thermograph0 - mode
	thermograph4 - mode
	infrared3 - mode
	infrared1 - mode
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star5 - direction
	GroundStation7 - direction
	Star1 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument3 thermograph4)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared3)
	(supports instrument5 image2)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
)
(:goal (and
	(pointing satellite2 Star1)
	(have_image Star9 infrared3)
	(have_image Star10 infrared1)
	(have_image Star10 spectrograph5)
	(have_image Planet11 thermograph0)
	(have_image Planet12 infrared3)
	(have_image Phenomenon13 infrared1)
	(have_image Phenomenon13 image2)
	(have_image Phenomenon14 image2)
	(have_image Phenomenon14 spectrograph5)
))

)

; plan
1. (turn_to satellite3 star4 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star4)
   goals met: 0 of 10
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite3 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite3 star9 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star9)
   goals met: 0 of 10
5. (take_image satellite3 star9 instrument5 infrared3)
   added: (have_image star9 infrared3)
   goals met: 1 of 10
6. (turn_to satellite3 planet12 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 planet12)
   goals met: 1 of 10
7. (take_image satellite3 planet12 instrument5 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 2 of 10
8. (turn_to satellite3 phenomenon13 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 10
9. (take_image satellite3 phenomenon13 instrument5 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 10
10. (turn_to satellite3 groundstation7 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation7)
   goals met: 3 of 10
11. (switch_off instrument5 satellite3)
   deleted: (power_on instrument5)
   added: (power_avail satellite3)
   goals met: 3 of 10
12. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 3 of 10
13. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 10
14. (calibrate satellite3 instrument4 groundstation7)
   added: (calibrated instrument4)
   goals met: 3 of 10
15. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 3 of 10
16. (turn_to satellite2 phenomenon14 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 10
17. (take_image satellite2 phenomenon14 instrument3 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 10
18. (turn_to satellite2 planet11 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet11)
   goals met: 4 of 10
19. (take_image satellite2 planet11 instrument3 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 10
20. (turn_to satellite2 star1 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star1)
   goals met: 6 of 10
21. (turn_to satellite3 phenomenon13 groundstation7)
   deleted: (pointing satellite3 groundstation7)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 10
22. (take_image satellite3 phenomenon13 instrument4 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 7 of 10
23. (turn_to satellite3 phenomenon14 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon14)
   goals met: 7 of 10
24. (take_image satellite3 phenomenon14 instrument4 spectrograph5)
   added: (have_image phenomenon14 spectrograph5)
   goals met: 8 of 10
25. (turn_to satellite3 star10 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star10)
   goals met: 8 of 10
26. (take_image satellite3 star10 instrument4 infrared1)
   added: (have_image star10 infrared1)
   goals met: 9 of 10
27. (take_image satellite3 star10 instrument4 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 10 of 10
